app/controllers/account_controller.rb

  def index
    redirect_to(:action => 'signup') unless logged_in? || User.count > 0
---
SELECT count(*) AS count_all FROM "users"

  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!
---
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('dcd1238e52c2540939561360a29b174c26740dbc', '2009-07-13 23:32:04', 'abb3491a1c719e08ae7f6c37e85325fd24767653', NULL, '2009-07-13 23:32:04', NULL, 'hola', 'asdf@asdf.com')