app/controllers/lists_controller.rb

  def show
    @list = current_user.lists.find(params[:id])
---
SELECT * FROM "lists" WHERE ("lists"."id" = 3 AND ("lists".user_id = 1))

  def new
    @list = current_user.lists.create(params[:list])
---
INSERT INTO "lists" ("created_at", "title", "updated_at", "user_id") VALUES('2009-07-13 23:44:28', NULL, '2009-07-13 23:44:28', 1)

  def edit
    @list = current_user.lists.find(params[:id])
---
SELECT * FROM "lists" WHERE ("lists"."id" = 3 AND ("lists".user_id = 1))

  def create
    @list = current_user.lists.create(params[:list])
---
INSERT INTO "lists" ("created_at", "title", "updated_at", "user_id") VALUES('2009-07-13 23:32:12', 'mi lista', '2009-07-13 23:32:12', NULL)

  def update
    @list = current_user.lists.find(params[:id])

    respond_to do |format|
      if @list.update_attributes(params[:list])
---
SELECT * FROM "lists" WHERE ("lists"."id" = 3 AND ("lists".user_id = 1))
UPDATE "lists" SET "updated_at" = '2009-07-13 23:44:29', "title" = 'asdf' WHERE "id" = 3

  def destroy
    @list = current_user.lists.find(params[:id])
    @list.destroy
---
SELECT * FROM "lists" WHERE ("lists"."id" = 11 AND ("lists".user_id = 4))
DELETE FROM "lists" WHERE "id" = 11