app/controllers/todos_controller.rb

def create
    # Create a todo object that has
    # been instantiated with attributes
    # and linked to the list object
    @todo = @list.todos.create(params[:todo])
---
INSERT INTO "todos" ("created_at", "body", "updated_at", "list_id") VALUES('2009-07-16 11:48:41', 'asdfasdfasdfasdf', '2009-07-16 11:48:41', 8)

  def destroy
    @todo = @list.todos.find(params[:id])
    @todo.destroy
---
SELECT * FROM "todos" WHERE ("todos"."id" = 18 AND ("todos".list_id = 9))
DELETE FROM "todos" WHERE "id" = 18